openfoam/combined_test_workflow/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    rocket.stl
    {
        type triSurfaceMesh;
        name rocket;
    }
}

castellatedMeshControls
{
    // Reduced from 8M to 4M (Level 5 generates far fewer cells)
    maxGlobalCells 4000000; 
    maxLocalCells  1000000; 
    
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    
    // Safety buffer: 4 is still good to prevent crashing
    nCellsBetweenLevels 4; 

    features
    (
        {
            file "rocket.eMesh";
            level 5; // The "Goldilocks" Edge: ~3cm resolution
        }
    );

    refinementSurfaces
    {
        rocket
        {
            // Surface: Level 4 (6cm) flat, Level 5 (3cm) at curves/edges
            level (4 5); 
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        rocket
        {
            mode distance;
            levels 
            (
                // THE BALANCED STEP-DOWN
                // 3cm -> 6cm -> 12cm -> 25cm
                
                (0.2 5)  // 0.0m - 0.2m: Level 5 (High detail near skin)
                (0.5 4)  // 0.2m - 0.5m: Level 4
                (1.0 3)  // 0.5m - 1.0m: Level 3
                (2.0 2)  // 1.0m - 2.0m: Level 2
            );
        }
    }

    locationInMesh (-20 -20 -15);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    
    // Reduced iterations since Level 5 snaps much easier than Level 6
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        rocket
        {
            nSurfaceLayers 3;
        }
    }
    expansionRatio 1.2;
    finalLayerThickness 0.5;
    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-30;
    minArea -1;
    minTwist 0.05;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}

mergeTolerance 1e-6;

// ************************************************************************* //