openfoam/combined_test_workflow/0.orig/U.slip
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0]; // m/s

internalField   uniform (0 0 680); // Mach 2 approx (Speed of Sound ~340 m/s)

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 680);
    }
    outlet
    {
        // Standard outlet that lets flow leave without reflecting
        type            zeroGradient;
    }
    atmosphere
    {
        type            slip;
    }
    rocket
    {
        // THE KEY DIFFERENCE: Frictionless
        type            slip;
    }
}