openfoam/combined_test_workflow/0.orig/p.compressible
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
dimensions      [1 -1 -2 0 0 0 0]; // kg/(m*s^2) -> Pascals

internalField   uniform 101325;

boundaryField
{
    inlet       { type fixedValue; value uniform 101325; }
    outlet      { type waveTransmissive; field p; psi psi; gamma 1.4; value uniform 101325; }
    atmosphere  { type waveTransmissive; field p; psi psi; gamma 1.4; value uniform 101325; }
    rocket      { type zeroGradient; }
}
// Note: 'waveTransmissive' prevents shockwaves from bouncing off the outlet/sky.