openfoam/combined_test_workflow/0.orig/p.incompressible
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
dimensions      [0 2 -2 0 0 0 0]; // m^2/s^2

internalField   uniform 0;

boundaryField
{
    inlet       { type zeroGradient; }
    outlet      { type fixedValue; value uniform 0; }
    atmosphere  { type fixedValue; value uniform 0; }
    rocket      { type zeroGradient; }
}