openfoam/combined_test_workflow/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0]; // 1/s

internalField   uniform 10;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 10;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }
    rocket
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
}