openfoam/combined_test_workflow/Allmesh
#!/bin/bash

# --- STEP 1: CLEANUP ---
# Remove any old mesh to ensure a fresh start.
# If we don't do this, OpenFOAM might try to merge the new mesh with the old one.
echo "Cleaning up old mesh..."
rm -rf constant/polyMesh
rm -rf 0/polyMesh

# --- STEP 2: BACKGROUND MESH ---
# Create the large block of air (The "Marble").
echo "Running blockMesh..."
blockMesh

# --- STEP 3: FEATURE EXTRACTION ---
# Read the STL and identify sharp edges (The "Chisel Lines").
echo "Running surfaceFeatureExtract..."
surfaceFeatureExtract

# --- STEP 4: SNAPPYHEXMESH ---
# Carve the rocket out of the block.
# -overwrite : Replaces the blockMesh directly in constant/polyMesh 
#              instead of creating a new time folder like '0.001'.
echo "Running snappyHexMesh..."
snappyHexMesh -overwrite

# --- STEP 5: QUALITY CHECK ---
# Verify the mesh is good enough for physics.
echo "Checking mesh..."
checkMesh

echo "Meshing Complete!"